### Step1: 导入必要的库

In [2]:
import pandas as pd #数据分析
import numpy as np #科学计算

In [3]:
data_train = pd.read_csv("../input/titanic.csv")

In [4]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 一、 数据选取

## 1.1 按照位置选取

### 选取第500行以后的数据

In [7]:
temp = data_train[500:]

### 选取500行以后且第3列之后数据


采用 `DataFrame.iloc` 按照索引位置选取

In [11]:
temp = data_train.iloc[500:,3:]

## 1.2 按照条件选取数据

### 选取 'Survived', 'Ticket' 两列

In [5]:
temp = data_train[['Survived', 'Ticket']]

### 选取Embarked = S 的数据

按条件选取数据，最新的pandas接口 采用 `DataFrame.loc` o方法 .
[官方文档](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html?highlight=loc#pandas.DataFrame.loc)

In [9]:
temp = data_train.loc[data_train['Embarked']=='S',:]

### 选取Embarked = S 且 SibSp =1 的样本PassengerId 和 Survived数据

In [10]:
temp = data_train.loc[(data_train['Embarked']=='S')&(data_train['SibSp']==1),['PassengerId','Survived']]

### 选取Cabin 在cabin_list的所有数据

- cabin_list =['C92', 'E38', 'D21', 'E12', 'E63', 'A14', 'B37', 'C30', 'D20']

In [12]:
cabin_list =['C92', 'E38', 'D21', 'E12', 'E63', 'A14', 'B37', 'C30', 'D20']

In [22]:
temp = data_train.loc[data_train['Cabin'].isin(cabin_list),:]

### 选取Cabin <font color=red>不在</font>cabin_list的所有数据

In [11]:
temp = data_train.loc[~data_train['Cabin'].isin(cabin_list),:]

In [13]:
temp.head()

,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
500,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
501,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q
502,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q
503,"Laitinen, Miss. Kristina Sofia",female,37.0,0,0,4135,9.5875,NaN,S
504,"Maioni, Miss. Roberta",female,16.0,0,0,110152,86.5000,B79,S

## 1.3 按照类型选取数据

In [14]:
#　 查看数值型特征
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### 选取所有数值型特征数据

In [15]:
num_data = data_train.select_dtypes(include = ['float64','int64'])

In [16]:
num_data.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

### 选取所有类别型特征数据

In [17]:
num_data = data_train.select_dtypes(include = ['object'])

In [18]:
num_data.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

## 二、排序

### 对Age进行倒序排列

In [30]:
temp = data_train.sort_values(by =['Age'],ascending =False)

In [18]:
# data_train.sort_values??

In [30]:
# 排序后可以 直接赋值回去 
# data_train.sort_values(by =['Age'],ascending =False,inplace=True)
# data_train = data_train.sort_values(by =['Age'],ascending =False)

### 对'Age','Pclass' 进行排倒序 缺失值排在最前面

In [19]:
temp = data_train.sort_values(by = ['Age','Pclass'],ascending = False, na_position = 'first')

### 利用rank() 方法排序(掌握) 
返回对应数据的序号

In [40]:
# data_train['Survived'].value_counts()

In [41]:
data_train.rank(method='dense')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,1.0,3.0,109.0,2.0,29.0,2.0,1.0,524.0,19.0,NaN,3.0
1,2.0,2.0,1.0,191.0,1.0,52.0,2.0,1.0,597.0,208.0,82.0,1.0
2,3.0,2.0,3.0,354.0,1.0,35.0,1.0,1.0,670.0,42.0,NaN,3.0
3,4.0,2.0,1.0,273.0,1.0,48.0,2.0,1.0,50.0,190.0,56.0,3.0
4,5.0,1.0,3.0,16.0,2.0,48.0,1.0,1.0,473.0,44.0,NaN,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887.0,1.0,2.0,549.0,2.0,36.0,1.0,1.0,102.0,86.0,NaN,3.0
887,888.0,2.0,1.0,304.0,1.0,25.0,1.0,1.0,15.0,154.0,31.0,3.0
888,889.0,1.0,3.0,414.0,1.0,NaN,2.0,3.0,676.0,132.0,NaN,3.0
889,890.0,2.0,1.0,82.0,2.0,35.0,1.0,1.0,9.0,154.0,61.0,1.0
890,891.0,1.0,3.0,221.0,2.0,43.0,1.0,1.0,467.0,31.0,NaN,2.0

## 三、去重

### 统计重复数量 

### 计算 数据中不同性别和年龄 ['Sex','Age'] 重复数据量

In [44]:
sub_data = data_train[['Sex','Age']]

In [46]:
# 运用 `DataFrame.duplicated` 方法
sub_data.duplicated().sum()

744

### 统计非重复数量

In [47]:
dup_num = len(data_train) - sub_data.duplicated().sum()
dup_num

147

### 显示重复的行数

In [48]:
sub_data[sub_data.duplicated()]

        Sex   Age
14   female  14.0
16     male   2.0
17     male   NaN
20     male  35.0
25   female  38.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[744 rows x 2 columns]

### 剔重操作
### 剔除  'Sex','Age' 的重复数据 temp

运用 `pd.DataFrame.drop_duplicates` 方法

In [50]:
temp = data_train.drop_duplicates([ 'Sex','Age' ])
# sub_data3.drop_duplicates(['Sex_bool','Title2'],keep = 'last',inplace =False)

In [51]:
temp.shape

(147, 12)

## 四、索引操作

### 将temp索引 变为列

In [56]:
temp.head()

,index,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,,
1,0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
temp.reset_index(drop = False,inplace = True)

### 将temp PassengerId 列 变设置为索引

In [55]:
temp.set_index('PassengerId',inplace = True)